---
kind: property
id: P:Autodesk.Revit.DB.EdgeArrayArray.Item(System.Int32)
source: html/1c11a712-f7ea-fbb5-f509-d133513edf3f.htm
---
# Autodesk.Revit.DB.EdgeArrayArray.Item Property

Gets or sets an edge array at a specified index within the array.

## Syntax (C#)
```csharp
public virtual EdgeArray this[
	int index
] { get; set; }
```

## Parameters
- **index** (`System.Int32`) - The index of the edge array to be set or retrieved.

## Returns
Returns the edge array at the specified index.